export const storyConfig = {
    id: '1',
    background: 'url("./assets/1.png")',
    title: 'Скромный фермер',
    message:
        'Вы — Робин, простой фермер, работающий на своей земле в деревне Эльдора. Ваша жизнь спокойна, но вы мечтаете о приключениях и славе. Однажды вы слышите о нападении разбойников на соседнюю деревню.',
    leftCard: {
        background: '',
        title: 'Собрать соседей и защитить деревню',
        message:
            'Вы решаете объединить силы с соседями и попытаться отразить нападение.',
        next: {
            id: '1.l',
            background: 'url("./assets/2.png")',
            title: 'Битва с разбойниками',
            message:
                'Вы и ваши соседи сражаетесь с разбойниками. Несмотря на то, что у вас нет опыта, ваша смелость и решимость помогают вам одержать победу. После битвы к вам подходит старый рыцарь, Сэр Альберт',
            leftCard: {
                id: '1.l.l',
                background: '',
                title: 'Принять предложение Сэра Альберта стать его учеником',
                message: 'Вы решаете обучиться искусству рыцарства',
                next: {},
            },
            rightCard: {
                id: '1.l.r',
                background: '',
                title: 'Отказаться и остаться фермером',
                message:
                    'Вы решаете, что ваша жизнь на поле важнее, и отказываетесь от предложения',
                next: {},
            },
        },
    },
    rightCard: {
        background: '',
        title: 'Игнорировать угрозу и продолжать работать',
        message:
            'Вы решаете не вмешиваться и продолжать заниматься своими делами.',
        next: {
            id: '1.r',
            background: 'url("./assets/3.png")',
            title: 'Потерянная Возможность',
            message:
                'Вы решили не вмешиваться в дела соседей и продолжили работать на своем поле. Вскоре разбойники нападают на вашу деревню. Вы теряете все, что у вас есть, и вынуждены бежать из родного села.',
            leftCard: {
                id: '1.r.l',
                background: '',
                title: 'Отправиться в ближайший город и искать работу',
                message:
                    'Вы решаете, что вам нужно найти новое место, где вы сможете заработать на жизнь и, возможно, встретить людей, которые помогут вам.',
                next: {},
            },
            rightCard: {
                id: '1.r.r',
                background: '',
                title: 'Искать других выживших и объединиться с ними',
                message:
                    'Вы решаете, что не хотите оставаться в одиночестве и ищете других выживших, чтобы объединиться и вместе найти способ справиться с угрозой.',
                next: {},
            },
        },
    },
};
